app/controllers/resumes_controller.rb

  def create
  	@resume = Resume.new(params[:resume])
  	if @resume.save
---
INSERT INTO "resumes" VALUES(DEFAULT) RETURNING "id"

  def index #to see the list of resumes
  	@resumes = Resume.all
---
SELECT "resumes".* FROM "resumes"