app/views/resumes/index.html.erb

		<li>
			<%= resume.personal_detail.firstname %>
---
SELECT "personal_details".* FROM "personal_details" WHERE "personal_details"."resume_id" = 1 LIMIT 1

		</li>
		<% resume.educations.each do |education| %>
---
SELECT "educations".* FROM "educations" WHERE "educations"."resume_id" = 1